#ifndef __OBJNETPKTDEFINE_H__
#define __OBJNETPKTDEFINE_H__
//-----------------------------------------------------------------------------
#pragma warning(disable:4786)
//-----------------------------------------------------------------------------
// 其他的封包必須繼承自 S_ObjNetPktBase
//-----------------------------------------------------------------------------
#define OBJNET_SYSPKTID 0xfffe
//-----------------------------------------------------------------------------
struct S_ObjNetPktBase
{
    union
    {
        struct
        {
            unsigned short wSysPktID;   
            unsigned short wCmdIID;     
        };

        unsigned int uiCmdID;   // 命令編號
    };
};
//-----------------------------------------------------------------------------
#endif                                                          // __OBJNETPKTDEFINE_H__
//-----------------------------------------------------------------------------